# Дано положительное двузначное число. Найдите число десятков в нем.
# Вводится единственное число (гарантируется, что оно соответствует условию задачи).

number = int(input("Введите число: "))
print(number // 10)
