# Дано натуральное число. Выведите его последнюю цифру.
# Вводится единственное целое положительное число (гарантируется, что оно не превышает 10000).

number = int(input())
print(number%10)
