# Дано целое число N. Выведите следующее за ним четное число.
number = int(input())
print(number + number % 2)
